var days = [
    {
        date: '2017-9-21',
        time: '15:52',
        title: '明天入驻苏宁',
        content:`
                    虽然没能入职苏宁，但是现在是以外包的形式进去的，希望在苏宁能提升自己的能力，这个平台对我来说还是
                    挺不错的，用的技术栈也是现在较新的，能和一些大牛在一起工作，还是很有挑战性的，那么下面我就要认真
                    了，我的目标就是能用技术打动苏宁的技术主管，然后能跳槽到苏宁，嗯！
                `
    },
    {
        date: '2017-9-5',
        time: '22:36',
        title: '育儿网面试未果',
        content:`
                    这个周末一直在准备育儿网的面试，面试前感觉信心满满的啊，肯定会过的，总计面试时间100mins，前部分都是
                    组长面试，问的问题也比较多，但是基本都答出来了，而且和他聊得还可以。但是到二面的时候，面试官是技术
                    主管，问的也都是些大方向的问题，像：PHP学多长时间可以开发啊，Object-C多久能学会呀，之类的。我被问蒙
                    了，老哥，我是来面试web前端的啊，你怎么问的都是非前端的东西，你要是不想要直接讲就行了啊，没必要这么
                    搞事情啊，哎，大专真是处处不待见啊。改进：让自己的技术更牛逼，拿出更好的作品，学得更广点，虽然只有
                    三点，但是好也不是容易的事情啊，告诉自己每天都不要松懈，加油，少年！
                `
    },
    {
        date: '2017-8-23',
        time: '21:36',
        title: '小倩倩想学前端，怎么办',
        content:`
                    她今天告诉我，她要学前端，叫我做她师傅，我答应了。
                `
    },
    {
        date: '2017-7-27',
        time: '9:35',
        title: '工作定下来了',
        content:`
                    昨天把工作定下来了，在集庆门大街，虽然挺远的，但是工作本身还不错，下面就是好好地工作，进一步提升自己，
                    承担点家里的房贷，好好爱家人，人嘛，为的就是生活。
                `
    },
    {
        date: '2017-7-22',
        time: '12:01',
        title: '和周烩家成为邻居',
        content:`
                    昨天听周烩讲，他家在县城的房子买了，就买在我家旁边。what？这个真的是太出乎意料了啊，在乡下就是邻居，在县
                    城还是邻居，这真是修来的缘分啊，反正真的真的很意外，我家901，他家902，这个世界有点可爱啊，讲道理。
                `
    },
    {
        date: '2017-7-15',
        time: '08:30',
        title: '告别上海，前往南京',
        content:`
                    来上海快两年了，上海的确不愧是中国的第一城市，什么都有。。。。。。不知道说些什么好，本来想说的话倒是挺多，
                    但是等到翘起键盘时，却什么也说不出来了。就这样吧，谢谢上海，谢谢诸位，有缘再会。然后就是南京，你好，我又
                    回来了，这次回来，我可是抱有很大自信的回来，不再是两年前的我了，我现在已经转行做IT了，不再是机械工了，你
                    准备好迎接一名优秀的前端工程师了吗？我来了
                `
    },
    {
        date: '2017-7-11',
        time: '20:05',
        title: '散伙饭',
        content: `
                    自从去年9月辞职以后，一直和张浩他们一起住，因为他们公司提供免费的住宿。然后我住的书房，小辛和方悦睡一张床，
                    所以真的很感激，他们牺牲的太多。然后就是这周小辛要被调去深圳，而我也要辞职，离开上海了。特意请他们吃了个饭，
                    都是在外打工，不容易，感谢陪伴与支持，兄弟们，来日方长。
                 `
    },
    {
        date: '2017-7-6',
        time: '20:14',
        title: '好久没有打球',
        content: `
                    自从入行IT后，自己知道自己很欠缺知识，所有每天下班回来后还得不断地学习，好久没有光顾篮球场了。自己其实也
                    知道自己的身体素质在下降，肌肉也变得松弛了，女友也埋怨我没有以前好用了。。。。。。但是，工作毕竟只是生活的一
                    部分，没有了身体，你说个鸡巴，身体毁了，你工作再出色，也不能持久。。。所有以后还是得多多运动，爱惜自己的身
                    体，今天我，又来到了篮球场，虽然没有了以前水平，但是那种挥汗和渴望胜利的心情，终于回来了，篮球场，我会再
                    次光顾。
                 `
    },
    {
        date: '2017-6-22',
        time: '21:42',
        title: '离开倒计时',
        content: `
                    终于还是要离开汉坤了，在汉坤真的是成长了很多啊，虽然是小公司，但是带我的组长却是很厉害，让我学到了很多东西，
                    但是还是女友更重要吧，，所以我选择去南京发展了，希望汉坤能越来越好，也希望自己能在南京找个好工作，长久地
                    发展下去，路漫漫其修远兮，吾将上下而求索。
                 `
    },
    {
        date: '2017-6-15',
        time: '20:53',
        title: '项目奖金',
        content: `
                    哈哈哈，今天终于发项目奖金了，也不枉我这8月来的辛苦耕耘，大家都知道的，在初创公司里要吃很多苦，受很多委屈，
                    也是一种成长吧，成长也疼的，大家知道就好。会议要结束，老板给我包了个红包，我是很高兴啦，很久之前组长就说这
                    事了，早就期待已久了捏。回家后第一件事就是拆红包，500元，哦，整整6个项目，哦，厉害了。
                 `
    },
    {
        date: '2017-6-13',
        time: '7:17',
        title: '从这里开始时',
        content: '小华的大事件，终于上线啦，记录每一次感动的瞬间，对老年的自己有个交代'
    }
];
var timeLine = document.querySelector('ul.timeline');  //时间线的wrapper，ul

var daysFormat = '';
for(var i=0;i<days.length;i++){
    var li =
        `
            <li>
                <time class="time" datetime="${days[i].date} ${days[i].time}">
                    <span>${days[i].date}</span><span>${days[i].time}</span>
                </time>
                <div class="label">
                    <h2>${days[i].title}</h2>
                    <p>${days[i].content}</p>
                </div>
            </li>
        `;
    daysFormat+=li;
}
timeLine.innerHTML = daysFormat;
